IDEA Open Model
SectionResultBase Class
Compatible with IDEA StatiCa Beta 20.0
 Section result base
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.Result.SectionResultBase
 IdeaRS.OpenModel.Result.ResultOfDeformation
 IdeaRS.OpenModel.Result.ResultOfInteractionDiagramPlane
 IdeaRS.OpenModel.Result.ResultOfInternalForces
 IdeaRS.OpenModel.Result.SectionResultMesh
 IdeaRS.OpenModel.Result.SectionResultOnPoints
 Namespace: IdeaRS.OpenModel.Result
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public abstract class SectionResultBase
Public MustInherit Class SectionResultBase
The SectionResultBase type exposes the following members.
Constructors
Name | Description
SectionResultBase
Initializes a new instance of the SectionResultBase class
Top
Properties
Name | Description
Loading
 Loading
Top
See Also
Reference
IdeaRS.OpenModel.Result Namespace